Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.GetBasePointByGuid Method
 Gets a base point by given guid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BasePoint GetBasePointByGuid(
	Guid guid
)
Public Shared Function GetBasePointByGuid (
	guid As Guid
) As BasePoint
Parameters
guid
Type: System.Guid
The guid of the base point.
Return Value
Type: BasePoint
If found, the base point, otherwise empty base point.
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace